Revit 2026 API

# ConnectorOrigin Property

---

The location of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual XYZ Origin { get; set; }
```
```vb
Public Overridable Property Origin As XYZ
	Get
	Set
```
```cpp
public:
virtual property XYZ^ Origin {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
abstract Origin : XYZ with get, set
override Origin : XYZ with get, set
```

#### Property Value

XYZ

#### Implements

IConnectorOrigin

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when connector's type is NonEndConn. Thrown when the connector is a part of a family instance. |
| ArgumentException | Thrown when the assigned origin is invalid. |
| InvalidOperationException | Thrown on failure to set origin. |

Changing the location of the connector may lead to changes of location and geometry for the connector's host element and the hosts for other elements the element is connected to.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace